In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv(r"C:\Users\HM7\OneDrive\Desktop\AI-ML\Python Case Studies\Cars24 Case Study\cars.csv")

## üîç Basic Data Exploration Questions

In [111]:
# df.drop(columns=['New_Price'], inplace=True)
# - Dropped the New_Price column as didn't had any useful data.

1.	Display the first 5 rows of the dataset.

In [112]:
print("\nFirst 5 rows of the dataset:")
df.head()

First 5 rows of the dataset:

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,KM,Power,MM,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.60,km/kg,58.16,bhp,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67,kmpl,126.20,bhp,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.20,kmpl,88.70,bhp,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77,kmpl,88.76,bhp,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,kmpl,140.80,bhp,17.74

2.	Check the number of missing values in each column.

In [113]:
print("\nNumber of missing values in each column:")
df.isnull().sum()

Number of missing values in each column:

S.No.                   0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
KM                      2
Power                 175
MM                     46
Price                1234
dtype: int64

3.	What is the data type of each column?

In [114]:
print("\nData type of each column:")
df.dtypes

Data type of each column:

S.No.                  int64
Name                  object
Location              object
Year                   int64
Kilometers_Driven      int64
Fuel_Type             object
Transmission          object
Owner_Type            object
Mileage              float64
KM                    object
Power                float64
MM                    object
Price                float64
dtype: object

4.	How many unique car models are there?

In [117]:
print("\nNumber of unique car models:")
df['Name'].nunique()

Number of unique car models:

2041

5.	Which columns have null values, and how would you handle them?

In [118]:
print("\nColumns with null values:")
null_values = df.columns[df.isnull().any()].tolist()
null_values

Columns with null values:

['Mileage', 'KM', 'Power', 'MM', 'Price']

In [120]:
df[['Mileage', 'KM', 'Power', 'MM', 'Price']].isna().sum()

Mileage       2
KM            2
Power       175
MM           46
Price      1234
dtype: int64

Columns 'Power' and 'Price' have significant missing values. So proper consideration is required before dealing with it.
Columns 'Mileage' and 'KM' can be dealt with by removing them.

In [134]:
df.dropna(subset= ['Mileage', 'KM'], inplace=True)

In [135]:
df.isna().sum()

S.No.                   0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
KM                      0
Power                   0
MM                     46
Price                1234
dtype: int64

In [132]:
df['Power'].fillna(df.Power.mean(), inplace=True)

In [133]:
df.isna().sum()

S.No.                   0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
KM                      2
Power                   0
MM                     46
Price                1234
dtype: int64

In [136]:
df['Price'].fillna(df.Price.mean(), inplace=True)

In [137]:
df.isna().sum()

S.No.                 0
Name                  0
Location              0
Year                  0
Kilometers_Driven     0
Fuel_Type             0
Transmission          0
Owner_Type            0
Mileage               0
KM                    0
Power                 0
MM                   46
Price                 0
dtype: int64

In [140]:
df['MM'].fillna(df.MM.mode()[0], inplace=True)

In [141]:
df.isna().sum()

S.No.                0
Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
KM                   0
Power                0
MM                   0
Price                0
dtype: int64

In [143]:
df.duplicated().sum()

0

All the null values are handeled and there are no duplicates in the resultant dataframe.

6.	What is the range (min-max) of car prices?

In [163]:
df.Price.min()
print(f"Minimum Price: {df['Price'].min()}")

Minimum Price: 0.44

In [164]:
df.Price.max()
print(f"Maximum Price: {df['Price'].max()}")

Maximum Price: 160.0

In [146]:
df.describe()

,S.No.,Year,Kilometers_Driven,Mileage,Power,Price
count,7251.000000,7251.000000,7.251000e+03,7251.000000,7251.000000,7251.000000
mean,3625.710661,2013.365329,5.870229e+04,18.141580,112.780595,9.478340
std,2094.117927,3.254604,8.443913e+04,4.562197,52.842679,10.192945
min,0.000000,1996.000000,1.710000e+02,0.000000,34.200000,0.440000
25%,1812.500000,2011.000000,3.400000e+04,15.170000,77.500000,3.850000
50%,3625.000000,2014.000000,5.344200e+04,18.160000,98.600000,6.750000
75%,5439.500000,2016.000000,7.300000e+04,21.100000,138.030000,9.478340
max,7252.000000,2019.000000,6.500000e+06,33.540000,616.000000,160.000000

7.	List the top 5 locations with the most cars listed.

In [172]:
print("\nTop 5 locations with the most cars listed:")
df.Location.value_counts().nlargest(5).reset_index()

Top 5 locations with the most cars listed:

        index  Location
0      Mumbai       948
1   Hyderabad       876
2  Coimbatore       772
3       Kochi       772
4        Pune       765

8.	Which year has the highest number of cars listed?

In [173]:
print("\nYear with the highest number of cars listed:")
df.Year.value_counts().idxmax()

Year with the highest number of cars listed:

2015

9.	What is the distribution of transmission types in the dataset?

In [174]:
print("\nDistribution of transmission types:")
df['Transmission'].value_counts()

Distribution of transmission types:

Manual       5204
Automatic    2047
Name: Transmission, dtype: int64

10.	Convert 'Mileage' and 'Power' columns into float values. Write a code snippet for it.

In [150]:
def convert_mileage_to_float(mileage):
    if isinstance(mileage, str):
        return float(mileage.split(' ')[0])
    return mileage

In [151]:
def convert_power_to_float(power):
    if isinstance(power, str):
        return float(power.split(' ')[0])
    return power

In [152]:
df.Mileage = df.Mileage.apply(convert_mileage_to_float)

In [153]:
df.Power = df.Power.apply(convert_power_to_float)

In [154]:
df.Mileage.dtype

dtype('float64')

In [155]:
df.Power.dtype

dtype('float64')

## üìä Grouping and Aggregation Questions

11.	Find the average selling price of cars by Fuel_Type.

In [176]:
print("\nAverage selling price of cars by Fuel_Type:")
df.groupby('Fuel_Type').Price.mean().reset_index()

Average selling price of cars by Fuel_Type:

  Fuel_Type      Price
0       CNG   4.093710
1    Diesel  12.275863
2       LPG   3.652223
3    Petrol   6.358851

12.	Which city has the highest average car price?

In [177]:
print("\nCity with the highest average car price:")
df.groupby('Location').Price.mean().idxmax()

City with the highest average car price:

'Coimbatore'

13.	Group the cars by Year and count how many cars were listed each year.

In [178]:
print("\nNumber of cars listed each year:")
df.groupby('Year').Name.nunique().sort_values(ascending=False).reset_index()

Number of cars listed each year:

    Year  Name
0   2016   513
1   2015   507
2   2014   477
3   2017   447
4   2013   427
5   2012   381
6   2011   331
7   2018   269
8   2010   257
9   2009   163
10  2008   153
11  2007   109
12  2019   108
13  2006    71
14  2005    52
15  2004    32
16  2003    19
17  2002    16
18  2001     8
19  2000     5
20  1998     4
21  1999     2
22  1996     1

In [179]:
print("\nNumber of cars listed each year:")
df.groupby('Year').Name.size().sort_values(ascending=False).reset_index()

Number of cars listed each year:

    Year  Name
0   2015   929
1   2014   925
2   2016   885
3   2013   791
4   2017   709
5   2012   690
6   2011   578
7   2010   407
8   2018   361
9   2009   252
10  2008   207
11  2007   148
12  2019   119
13  2006    89
14  2005    68
15  2004    35
16  2003    20
17  2002    18
18  2001     8
19  2000     5
20  1998     4
21  1999     2
22  1996     1

14.	Calculate the average mileage for each transmission type.

In [180]:
print("\nAverage mileage for each transmission type:")
df.groupby('Transmission').Mileage.mean().reset_index()

Average mileage for each transmission type:

  Transmission    Mileage
0    Automatic  15.757084
1       Manual  19.079525

15.	Which car model has the highest average price?

In [181]:
print("\nCar model with the highest average price:")
df.groupby('Name').Price.mean().idxmax()

Car model with the highest average price:

'Land Rover Range Rover 3.0 Diesel LWB Vogue'

16.	Group by Owner_Type and find the average kilometers driven.

In [182]:
print("\nAverage kilometers driven by Owner_Type:")
df.groupby('Owner_Type').Kilometers_Driven.mean().reset_index()

Average kilometers driven by Owner_Type:

       Owner_Type  Kilometers_Driven
0           First       55258.138824
1  Fourth & Above      119756.500000
2          Second       72433.625868
3           Third       87472.729927

17.	What is the average power (bhp) of diesel vs petrol cars?

In [183]:
print("\nAverage power (bhp) of diesel vs petrol cars:")
df.groupby('Fuel_Type').Power.mean()[['Diesel','Petrol']].reset_index()

Average power (bhp) of diesel vs petrol cars:

  Fuel_Type       Power
0    Diesel  126.949764
1    Petrol   97.436329

18.	Group the cars by 'Fuel_Type' and 'Transmission' and calculate the mean price.

In [184]:
print("\nMean price by Fuel_Type and Transmission:")
df.groupby(['Fuel_Type','Transmission']).Price.mean().reset_index()

Mean price by Fuel_Type and Transmission:

  Fuel_Type Transmission      Price
0       CNG       Manual   4.093710
1    Diesel    Automatic  22.186046
2    Diesel       Manual   7.127259
3       LPG       Manual   3.652223
4    Petrol    Automatic  10.966070
5    Petrol       Manual   5.062793

19.	Which Owner_Type has the highest average resale value?

In [185]:
print("\nOwner_Type with the highest average resale value:")
df.groupby('Owner_Type').Price.mean().idxmax()

Owner_Type with the highest average resale value:

'First'

20.	For each city, what is the average price of automatic cars?

In [186]:
print("\nAverage price of automatic cars in each city:")
automatic_cars = df[df['Transmission'] == 'Automatic']
automatic_cars.groupby('Location').Price.mean().reset_index()

Average price of automatic cars in each city:

      Location      Price
0    Ahmedabad  15.406622
1    Bangalore  21.351631
2      Chennai  16.469433
3   Coimbatore  23.474413
4        Delhi  18.320369
5    Hyderabad  19.452458
6       Jaipur  13.565861
7        Kochi  19.773647
8      Kolkata  14.957576
9       Mumbai  15.024852
10        Pune  13.762121